#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
module.lambda_layer_s3.data.external.archive_prepare[0]: Reading...
module.vehicle_data_function.data.external.archive_prepare[0]: Reading...
module.charing_history_exporter_function.data.external.archive_prepare[0]: Reading...
module.history_slicer_function.data.external.archive_prepare[0]: Reading...
module.history_slicer_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.history_slicer_function.local_file.archive_plan[0]: Refreshing state... [id=8b0f25e2036f08de617f38c1f28b9110d52161fe]
module.vehicle_data_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_layer_s3.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.charing_history_exporter_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_layer_s3.local_file.archive_plan[0]: Refreshing state... [id=993154f53519729f81debe4427087712f684ae0d]
module.vehicle_data_function.local_file.archive_plan[0]: Refreshing state... [id=9c3375b9f10cd4d6408f1a46008846e35e5ab42f]
module.charing_history_exporter_function.local_file.archive_plan[0]: Refreshing state... [id=4fa2966c4b8f2ddcca52662d61cb3d3ee2a78322]
module.history_slicer_function.null_resource.archive[0]: Refreshing state... [id=1990544910225240255]
module.vehicle_data_function.null_resource.archive[0]: Refreshing state... [id=9207547090008783641]
aws_ssm_parameter.refresh_token: Refreshing state... [id=/tesla-data-exporter/refresh_token]
module.lambda_layer_s3.null_resource.archive[0]: Refreshing state... [id=5482772263713729061]
module.charing_history_exporter_function.null_resource.archive[0]: Refreshing state... [id=2364518768919255077]
module.charing_history_exporter_function.data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Reading...
module.vehicle_data.aws_dynamodb_table.this[0]: Refreshing state... [id=vehicle-data]
module.lambda_layer_s3.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.lambda_layer_s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vehicle_data_function.data.aws_region.current: Reading...
module.charing_history_exporter_function.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.vehicle_data_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_caller_identity.current: Reading...
module.charing_history_exporter_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_layer_s3.data.aws_caller_identity.current: Reading...
module.history_slicer_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.vehicle_data_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/vehicle-data]
module.history_slicer_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/history-slicer]
module.vehicle_data_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.lambda_layer_s3.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.charing_history_exporter_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.lambda_layer_s3.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
aws_s3_bucket.this: Refreshing state... [id=tesla-data-exporter20230820121120532200000002]
aws_ssm_parameter.email: Refreshing state... [id=/tesla-data-exporter/email]
module.lambda_layer_s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=tesla-data-exporter]
aws_cloudwatch_event_rule.exporter: Refreshing state... [id=tesla-data-exporter20231001174846219100000001]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.history_slicer_function.data.aws_region.current: Reading...
module.history_slicer_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=402889198055]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=tde-slicer]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7eb60e703ce476dda79c3026f9e3373dcf661ed201b4d53471100e2f29a9e43d]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.vehicle_data_function.data.aws_partition.current: Reading...
module.vehicle_data_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.history_slicer_function.data.aws_partition.current: Reading...
module.history_slicer_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.charing_history_exporter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=3693445097]
module.history_slicer_function.aws_iam_role.lambda[0]: Refreshing state... [id=history-slicer]
module.vehicle_data_function.aws_iam_role.lambda[0]: Refreshing state... [id=vehicle-data]
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Reading...
module.vehicle_data_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4225016675]
data.aws_iam_policy_document.vehicle_data: Reading...
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Reading...
module.vehicle_data_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/vehicle-data-logs]
data.aws_iam_policy_document.vehicle_data: Read complete after 0s [id=1837894490]
module.history_slicer_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=4275475925]
module.history_slicer_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::402889198055:policy/history-slicer-logs]
module.vehicle_data_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=vehicle-data-20231001174846802700000003]
module.history_slicer_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=history-slicer-20231001174846812600000004]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.history_exporter: Reading...
data.aws_iam_policy_document.history_exporter: Read complete after 0s [id=3850528508]
data.aws_iam_policy_document.history_slicer: Reading...
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=tesla-data-exporter]
data.aws_iam_policy_document.history_slicer: Read complete after 0s [id=3487884030]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=tesla-data-exporter]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=tesla-data-exporter,private]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.vehicle_data will be created
  + resource "aws_cloudwatch_event_rule" "vehicle_data" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + is_enabled          = true
      + name                = (known after apply)
      + name_prefix         = "tesla-data-exporter"
      + schedule_expression = "cron(0 5 * * *)"
      + tags_all            = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # aws_cloudwatch_event_target.exporter will be created
  + resource "aws_cloudwatch_event_target" "exporter" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "tesla-data-exporter20231001174846219100000001"
      + target_id      = (known after apply)
    }

  # aws_s3_bucket_notification.slicer will be created
  + resource "aws_s3_bucket_notification" "slicer" {
      + bucket      = "tesla-data-exporter20230820121120532200000002"
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "charge_history/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.charing_history_exporter_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.charing_history_exporter_function.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tesla-data-exporter"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # module.charing_history_exporter_function.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "tesla-data-exporter-logs"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
    }

  # module.charing_history_exporter_function.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "tesla-data-exporter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + unique_id             = (known after apply)
    }

  # module.charing_history_exporter_function.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "tesla-data-exporter"
    }

  # module.charing_history_exporter_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Export charging history"
      + filename                       = "./.terraform/lambda_builds/5a4c88fdafc6b51b02b43d4ae31adb9376010ac30962cd01a73eaa2a56c4b6f2.zip"
      + function_name                  = "tesla-data-exporter"
      + handler                        = "function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME"             = "arn:aws:s3:::tesla-data-exporter"
              + "EMAIL_SSM_PARAM_NAME"    = "/tesla-data-exporter/email"
              + "REFRESH_TOKEN_SSM_PARAM" = "/tesla-data-exporter/refresh_token"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.charing_history_exporter_function.aws_lambda_permission.current_version_triggers["EveryEightHours"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tesla-data-exporter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:events:us-east-1:402889198055:rule/tesla-data-exporter20231001174846219100000001"
      + statement_id        = "EveryEightHours"
      + statement_id_prefix = (known after apply)
    }

  # module.charing_history_exporter_function.aws_lambda_permission.unqualified_alias_triggers["EveryEightHours"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "tesla-data-exporter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:us-east-1:402889198055:rule/tesla-data-exporter20231001174846219100000001"
      + statement_id        = "EveryEightHours"
      + statement_id_prefix = (known after apply)
    }

  # module.charing_history_exporter_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "2364518768919255077" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696182523044851000" -> "1696182873755323000"
            # (1 unchanged element hidden)
        }
    }

  # module.history_slicer_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Slice charging history"
      + filename                       = "./.terraform/lambda_builds/4deff5a45418ed6a70bddc9fb22480ec8dff88ece629bdbbd524770d7d71be51.zip"
      + function_name                  = "history-slicer"
      + handler                        = "function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::402889198055:role/history-slicer"
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "tde-slicer"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.history_slicer_function.aws_lambda_permission.current_version_triggers["s3"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "history-slicer"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:s3:::tesla-data-exporter20230820121120532200000002"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.history_slicer_function.aws_lambda_permission.unqualified_alias_triggers["s3"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "history-slicer"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + source_arn          = "arn:aws:s3:::tesla-data-exporter20230820121120532200000002"
      + statement_id        = "s3"
      + statement_id_prefix = (known after apply)
    }

  # module.history_slicer_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1990544910225240255" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696182523044805000" -> "1696182873729105000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
  + resource "aws_lambda_layer_version" "this" {
      + arn                         = (known after apply)
      + compatible_runtimes         = [
          + "python3.10",
        ]
      + created_date                = (known after apply)
      + description                 = "Dependencies for tesla-data-exporter"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "tesla-data-exporter-dependencies"
      + s3_bucket                   = "tesla-data-exporter"
      + s3_key                      = "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      + s3_object_version           = (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
  + resource "aws_s3_object" "lambda_package" {
      + acl                    = "private"
      + bucket                 = "tesla-data-exporter"
      + bucket_key_enabled     = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "lambda-builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "./.terraform/lambda_builds/14ffd1d95c23718da392a2482742eac00279e92bfcbd537b2b36050475c211ba.zip"
      + storage_class          = "ONEZONE_IA"
      + tags_all               = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + version_id             = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5482772263713729061" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696182523044781000" -> "1696182873772643000"
            # (1 unchanged element hidden)
        }
    }

  # module.vehicle_data_function.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + description                    = "Export vehicle data"
      + filename                       = "./.terraform/lambda_builds/f7e4eb4716dc731fe96946ed23cd51b20fc481e6f754db5533900dc9941f4487.zip"
      + function_name                  = "vehicle-data"
      + handler                        = "function.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::402889198055:role/vehicle-data"
      + runtime                        = "python3.10"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Owner"      = "cvanlaw/tesla-data-lambda"
          + "Repository" = "https://github.com/cvanlaw/tesla-data-lambda"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "TABLE_NAME" = "vehicle-data"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + timeouts {}
    }

  # module.vehicle_data_function.aws_lambda_permission.current_version_triggers["AtMidnight"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "vehicle-data"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = (known after apply)
      + statement_id        = "AtMidnight"
      + statement_id_prefix = (known after apply)
    }

  # module.vehicle_data_function.aws_lambda_permission.unqualified_alias_triggers["AtMidnight"] will be created
  + resource "aws_lambda_permission" "unqualified_alias_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "vehicle-data"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AtMidnight"
      + statement_id_prefix = (known after apply)
    }

  # module.vehicle_data_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "9207547090008783641" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1696182523044782000" -> "1696182873749758000"
            # (1 unchanged element hidden)
        }
    }

Plan: 22 to add, 0 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pushed by: @cvanlaw, Action: `pull_request`*